TransportManagementDevelop_KAT/Конфигурация/src/Documents/гкс_РабочаяСмена/гкс_РабочаяСмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гкс_РабочаяСмена</name>
  <registerRecords>InformationRegister.гкс_СостоянияОбработкиСудов</registerRecords>
  <registerRecords>InformationRegister.гкс_СостоянияФрахта</registerRecords>
  <registerRecords>AccumulationRegister.гкс_ВыработкаСмены</registerRecords>
  <registerRecords>AccumulationRegister.гкс_ОбработкаСудов</registerRecords>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственныеСутки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фрахт</name>
    <type>
      <types>DocumentRef.гкс_Фрахт</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОбработкаСудна</name>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Силос</name>
      <type>
        <types>CatalogRef.гкс_ТочкиМаршрута</types>
      </type>
    </attributes>
    <attributes>
      <name>Трюм</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Весы</name>
      <type>
        <types>CatalogRef.гкс_ОборудованиеПЛК</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВыгруженПолностью</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументРегистрации</name>
      <type>
        <types>DocumentRef.гкс_РегистрацияНаПЛК</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_ТранспортныеДокументыФрахта/гкс_ТранспортныеДокументыФрахта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_ТранспортныеДокументыФрахта</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Коносамент</name>
    <type>
      <types>DocumentRef.гкс_ТранспортныйДокумент</types>
    </type>
  </resources>
  <dimensions>
    <name>Фрахт</name>
    <type>
      <types>DocumentRef.гкс_Фрахт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Трюм</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_ПланыРазгрузкиСудов/гкс_ПланыРазгрузкиСудов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_ПланыРазгрузкиСудов</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Причал</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияВеса</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПорядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Фрахт</name>
    <type>
      <types>DocumentRef.гкс_Фрахт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Трюм</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_СостоянияОбработкиСудна/гкс_СостоянияОбработкиСудна.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_СостоянияОбработкиСудна</name>
  <enumValues>
    <name>Выгружается</name>
  </enumValues>
  <enumValues>
    <name>Выгружен</name>
  </enumValues>
  <enumValues>
    <name>ВыгрузкаОстановлена</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_СостоянияТранспортныхСредств/гкс_СостоянияТранспортныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_СостоянияТранспортныхСредств</name>
  <enumValues>
    <name>ВПути</name>
  </enumValues>
  <enumValues>
    <name>Прибыл</name>
  </enumValues>
  <enumValues>
    <name>ВыгрузкаРазрешена</name>
  </enumValues>
  <enumValues>
    <name>Выгружен</name>
  </enumValues>
  <enumValues>
    <name>Убыл</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Documents/гкс_ТранспортныйДокумент/гкс_ТранспортныйДокумент.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гкс_ТранспортныйДокумент</name>
  <registerRecords>InformationRegister.гкс_ЖДНакладныеВагона</registerRecords>
  <attributes>
    <name>ПунктПогрузки</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПунктРазгрузки</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПогрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРазгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПеревозки</name>
    <type>
      <types>EnumRef.гкс_ТипыТранспортныхСредствДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловияПоставки</name>
    <type>
      <types>CatalogRef.гкс_УсловияПоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Владелец</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияВеса</name>
    <comment>Ед.измерения веса в документе</comment>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоДокументПЛК</name>
    <comment>Документ создан в текущей базе</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТранспортныеСредства</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ТранспортноеСредство</name>
      <type>
        <types>CatalogRef.ТранспортныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПогрузки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРазгрузки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесТары</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесБрутто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесНетто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФИОВодителя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>DocumentRef.гкс_ЗаявкаНаПеревозку</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

TransportManagementDevelop_KAT/Конфигурация/src/Documents/гкс_Фрахт/гкс_Фрахт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гкс_Фрахт</name>
  <registerRecords>InformationRegister.гкс_СостоянияФрахта</registerRecords>
  <registerRecords>InformationRegister.гкс_ПланыРазгрузкиСудов</registerRecords>
  <attributes>
    <name>Судно</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.гкс_СтатусыСудов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.гкс_ВидыОперацийФрахта</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрибытияНачало</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрибытияОкончание</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУбытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Грузы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияВеса</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПланОбработкиСудна</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Трюм</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияВеса</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОчередностьОбработки</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтрокиПОС</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Порядок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Причал</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Склады</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.гкс_ТочкиМаршрута</types>
      </type>
    </attributes>
    <attributes>
      <name>Трюм</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПропорцияСмешивания</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

TransportManagementDevelop_KAT/Конфигурация/src/Documents/гкс_РабочаяСмена/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область Проведение

// Описывает учетные механизмы используемые в документе для регистрации в механизме проведения.
//
// Параметры:
//  МеханизмыДокумента - Массив из Строка - список имен учетных механизмов, для которых будет выполнена
//              регистрация в механизме проведения.
//
Процедура ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента) Экспорт
	
	МеханизмыДокумента.Добавить("МорскаяЛогистика");
	
КонецПроцедуры

// Возвращает таблицы для движений, необходимые для проведения документа по регистрам учетных механизмов.
//
// Параметры:
//  Документ - ДокументСсылка, ДокументОбъект - ссылка на документ или объект, по которому необходимо получить данные
//  Регистры - Структура - список имен регистров, для которых необходимо получить таблицы
//  ДопПараметры - Структура - дополнительные параметры для получения данных, определяющие контекст проведения.
//
// Возвращаемое значение:
//  Структура - см. гкс_ПроведениеДокументов.ИнициализироватьДанныеДокументаДляПроведения.
Функция ДанныеДокументаДляПроведения(Документ, Регистры, ДопПараметры = Неопределено) Экспорт
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = гкс_ПроведениеДокументов.ДопПараметрыИнициализироватьДанныеДокументаДляПроведения();
	КонецЕсли;
	
	Если ТипЗнч(Документ) = Тип("ДокументОбъект.гкс_РабочаяСмена") Тогда
		ДокументСсылка = Документ.Ссылка;
	Иначе
		ДокументСсылка = Документ;
	КонецЕсли;
	
	Запрос			= Новый Запрос;
	ТекстыЗапроса	= Новый СписокЗначений;
	
	Если Не ДопПараметры.ПолучитьТекстыЗапроса Тогда
		////////////////////////////////////////////////////////////////////////////
		// Создадим запрос инициализации движений
		ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка, ДопПараметры);
		
		////////////////////////////////////////////////////////////////////////////
		// Сформируем текст запроса
		ТекстЗапросаТаблицаСостоянияОбработкиСудов(ТекстыЗапроса, Регистры);
		ТекстЗапросаТаблицаОбработкаСудов(ТекстыЗапроса, Регистры);
		ТекстЗапросаТаблицаСостоянияФрахта(ТекстыЗапроса, Регистры);
		ТекстЗапросаТаблицаВыработкаСмены(ТекстыЗапроса, Регистры);
		
	КонецЕсли;
	
	// Получим таблицы для движений
	Возврат гкс_ПроведениеДокументов.ИнициализироватьДанныеДокументаДляПроведения(Запрос, ТекстыЗапроса, ДопПараметры);
	
КонецФункции

#КонецОбласти

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// Подробней См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа
// 
//  Параметры:
//   Ограничение - Структура - со свойствами:
//    * Текст                             - Строка - ограничение доступа для пользователей.
//                                            Если пустая строка, значит, доступ разрешен.
//    * ТекстДляВнешнихПользователей      - Строка - ограничение доступа для внешних пользователей.
//                                            Если пустая строка, значит, доступ запрещен.
//    * ПоВладельцуБезЗаписиКлючейДоступа - Неопределено - определить автоматически.
//                                        - Булево - если Ложь, то всегда записывать ключи доступа,
//                                            если Истина, тогда не записывать ключи доступа,
//                                            а использовать ключи доступа владельца (требуется,
//                                            чтобы ограничение было строго по объекту-владельцу).
///   * ПоВладельцуБезЗаписиКлючейДоступаДляВнешнихПользователей - Неопределено, Булево - см.
//                                            описание предыдущего параметра.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Фрахт.ТочкаМаршрута)";
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Проведение

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка, ДопПараметры)
	
	МенеджерВременныхТаблиц = Неопределено;
	
	Если ДопПараметры <> Неопределено
		И ДопПараметры.Свойство("МенеджерВременныхТаблиц", МенеджерВременныхТаблиц) Тогда
		
		МенеджерВременныхТаблиц = ?(МенеджерВременныхТаблиц = Неопределено,
			Новый МенеджерВременныхТаблиц,
			МенеджерВременныхТаблиц);
		
	Иначе
		МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	КонецЕсли;
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ПустаяДата", гкс_ОбщегоНазначенияКлиентСервер.ПустаяДата());
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	ПодготовитьДанныеДокумента(Запрос);
	
КонецПроцедуры

Процедура ПодготовитьДанныеДокумента(Запрос)
	
	Запрос.Текст = ТекстЗапросаДанныеДокумента();
	Запрос.Выполнить();
	
КонецПроцедуры

Функция ТекстЗапросаДанныеДокумента()
	
	Возврат
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДокументРабочаяСмена.Ссылка КАК Ссылка,
	|	ДокументРабочаяСмена.Дата КАК Период,
	|	ДокументРабочаяСмена.Фрахт КАК Фрахт,
	|	ДокументРабочаяСмена.ДатаОкончания КАК ДатаОкончания,
	|	ДокументРабочаяСмена.ПроизводственныеСутки КАК ПроизводственныеСутки
	|ПОМЕСТИТЬ ДанныеДокумента
	|ИЗ
	|	Документ.гкс_РабочаяСмена КАК ДокументРабочаяСмена
	|ГДЕ
	|	ДокументРабочаяСмена.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РабочаяСменаОбработкаСудна.Ссылка КАК Ссылка,
	|	РабочаяСменаОбработкаСудна.ДатаНачала КАК ДатаНачала,
	|	РабочаяСменаОбработкаСудна.ДатаОкончания КАК ДатаОкончания,
	|	РабочаяСменаОбработкаСудна.Силос КАК Силос,
	|	РабочаяСменаОбработкаСудна.Трюм КАК Трюм,
	|	РабочаяСменаОбработкаСудна.Весы КАК Весы,
	|	РабочаяСменаОбработкаСудна.Количество КАК Количество,
	|	РабочаяСменаОбработкаСудна.ВыгруженПолностью КАК ВыгруженПолностью
	|ПОМЕСТИТЬ ДанныеОбработкиСудна
	|ИЗ
	|	Документ.гкс_РабочаяСмена.ОбработкаСудна КАК РабочаяСменаОбработкаСудна
	|ГДЕ
	|	РабочаяСменаОбработкаСудна.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТранспортныеДокументыФрахта.Фрахт КАК Фрахт,
	|	ТранспортныеДокументыФрахта.Трюм КАК Трюм,
	|	ТранспортныеДокументыФрахта.Коносамент КАК Коносамент
	|ПОМЕСТИТЬ ТранспортныеДокументыФрахта
	|ИЗ
	|	РегистрСведений.гкс_ТранспортныеДокументыФрахта КАК ТранспортныеДокументыФрахта
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеДокумента КАК ДанныеДокумента
	|		ПО ТранспортныеДокументыФрахта.Фрахт = ДанныеДокумента.Фрахт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПланыРазгрузкиСудов.Номенклатура КАК Номенклатура,
	|	ПланыРазгрузкиСудов.ЕдиницаИзмеренияВеса КАК ЕдиницаИзмеренияВеса,
	|	ПланыРазгрузкиСудов.Трюм КАК Трюм
	|ПОМЕСТИТЬ ПланыРазгрузкиСудов
	|ИЗ
	|	РегистрСведений.гкс_ПланыРазгрузкиСудов КАК ПланыРазгрузкиСудов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеДокумента КАК ДанныеДокумента
	|		ПО ПланыРазгрузкиСудов.Фрахт = ДанныеДокумента.Фрахт";

КонецФункции

Процедура ТекстЗапросаТаблицаСостоянияОбработкиСудов(ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "гкс_СостоянияОбработкиСудов";
	
	Если Не гкс_ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли; 
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ДанныеДокумента.Фрахт КАК Фрахт,
	|	ДанныеОбработкиСудна.ДатаНачала КАК ДатаНачала,
	|	ДанныеОбработкиСудна.ДатаОкончания КАК ДатаОкончания,
	|	ДанныеОбработкиСудна.ВыгруженПолностью КАК ВыгруженПолностью,
	|	ДанныеОбработкиСудна.Трюм КАК Трюм,
	|	ДанныеОбработкиСудна.Силос КАК Силос,
	|	ДанныеОбработкиСудна.Весы КАК Весы,
	|	ДанныеДокумента.ПроизводственныеСутки КАК ПроизводственныеСутки,
	|	ЕСТЬNULL(ТранспортныеДокументыФрахта.Коносамент, ЗНАЧЕНИЕ(Документ.гкс_ТранспортныйДокумент.ПустаяСсылка)) КАК
	|		Коносамент
	|ПОМЕСТИТЬ ДанныеОбработкиСуднаПолный
	|ИЗ
	|	ДанныеДокумента КАК ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеОбработкиСудна КАК ДанныеОбработкиСудна
	|			ЛЕВОЕ СОЕДИНЕНИЕ ТранспортныеДокументыФрахта КАК ТранспортныеДокументыФрахта
	|			ПО ДанныеОбработкиСудна.Трюм = ТранспортныеДокументыФрахта.Трюм
	|		ПО ДанныеДокумента.Ссылка = ДанныеОбработкиСудна.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеОбработкиСуднаПолный.ДатаНачала КАК Период,
	|	ДанныеОбработкиСуднаПолный.Фрахт КАК Фрахт,
	|	ДанныеОбработкиСуднаПолный.Коносамент КАК Коносамент,
	|	ДанныеОбработкиСуднаПолный.Трюм КАК Трюм,
	|	ДанныеОбработкиСуднаПолный.Силос КАК Силос,
	|	ДанныеОбработкиСуднаПолный.Весы КАК Весы,
	|	ДанныеОбработкиСуднаПолный.ПроизводственныеСутки КАК ПроизводственныеСутки,
	|	ЗНАЧЕНИЕ(Перечисление.гкс_СостоянияОбработкиСудна.Выгружается) КАК Состояние
	|ИЗ
	|	ДанныеОбработкиСуднаПолный КАК ДанныеОбработкиСуднаПолный
	|ГДЕ
	|	НЕ ДанныеОбработкиСуднаПолный.ДатаНачала = &ПустаяДата
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеОбработкиСуднаПолный.ДатаОкончания,
	|	ДанныеОбработкиСуднаПолный.Фрахт,
	|	ДанныеОбработкиСуднаПолный.Коносамент,
	|	ДанныеОбработкиСуднаПолный.Трюм,
	|	ДанныеОбработкиСуднаПолный.Силос,
	|	ДанныеОбработкиСуднаПолный.Весы КАК Весы,
	|	ДанныеОбработкиСуднаПолный.ПроизводственныеСутки,
	|	ЗНАЧЕНИЕ(Перечисление.гкс_СостоянияОбработкиСудна.Выгружен)
	|ИЗ
	|	ДанныеОбработкиСуднаПолный КАК ДанныеОбработкиСуднаПолный
	|ГДЕ
	|	ДанныеОбработкиСуднаПолный.ВыгруженПолностью
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеОбработкиСуднаПолный.ДатаОкончания,
	|	ДанныеОбработкиСуднаПолный.Фрахт,
	|	ДанныеОбработкиСуднаПолный.Коносамент,
	|	ДанныеОбработкиСуднаПолный.Трюм,
	|	ДанныеОбработкиСуднаПолный.Силос,
	|	ДанныеОбработкиСуднаПолный.Весы КАК Весы,
	|	ДанныеОбработкиСуднаПолный.ПроизводственныеСутки,
	|	ЗНАЧЕНИЕ(Перечисление.гкс_СостоянияОбработкиСудна.ВыгрузкаОстановлена)
	|ИЗ
	|	ДанныеОбработкиСуднаПолный КАК ДанныеОбработкиСуднаПолный
	|ГДЕ
	|	НЕ ДанныеОбработкиСуднаПолный.ДатаНачала = &ПустаяДата
	|	И НЕ ДанныеОбработкиСуднаПолный.ДатаОкончания = &ПустаяДата
	|	И НЕ ДанныеОбработкиСуднаПолный.ВыгруженПолностью
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период,
	|	Трюм";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
КонецПроцедуры

Процедура ТекстЗапросаТаблицаОбработкаСудов(ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "гкс_ОбработкаСудов";
	
	Если Не гкс_ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли; 
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ДанныеДокумента.Фрахт КАК Фрахт,
	|	ДанныеДокумента.ДатаОкончания КАК ДатаОкончанияСмены,
	|	ДанныеОбработкиСудна.Трюм КАК Трюм,
	|	СУММА(ДанныеОбработкиСудна.Количество) КАК Количество
	|ПОМЕСТИТЬ ОбработкаСудов
	|ИЗ
	|	ДанныеДокумента КАК ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеОбработкиСудна КАК ДанныеОбработкиСудна
	|		ПО ДанныеДокумента.Ссылка = ДанныеОбработкиСудна.Ссылка
	|		И НЕ ДанныеДокумента.ДатаОкончания = &ПустаяДата
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Фрахт,
	|	ДанныеДокумента.ДатаОкончания,
	|	ДанныеОбработкиСудна.Трюм
	|ИМЕЮЩИЕ
	|	СУММА(ДанныеОбработкиСудна.Количество) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ОбработкаСудов.Фрахт КАК Фрахт,
	|	ОбработкаСудов.ДатаОкончанияСмены КАК Период,
	|	ОбработкаСудов.Трюм КАК Трюм,
	|	ОбработкаСудов.Количество КАК Количество,
	|	ЕСТЬNULL(ТранспортныеДокументыФрахта.Коносамент, ЗНАЧЕНИЕ(Документ.гкс_ТранспортныйДокумент.ПустаяСсылка)) КАК
	|		Коносамент,
	|	ЕСТЬNULL(ПланыРазгрузкиСудов.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
	|	ЕСТЬNULL(ПланыРазгрузкиСудов.ЕдиницаИзмеренияВеса, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) КАК
	|		ЕдиницаИзмеренияВеса
	|ИЗ
	|	ОбработкаСудов КАК ОбработкаСудов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТранспортныеДокументыФрахта КАК ТранспортныеДокументыФрахта
	|		ПО ОбработкаСудов.Фрахт = ТранспортныеДокументыФрахта.Фрахт
	|		И ОбработкаСудов.Трюм = ТранспортныеДокументыФрахта.Трюм
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланыРазгрузкиСудов КАК ПланыРазгрузкиСудов
	|		ПО ОбработкаСудов.Трюм = ПланыРазгрузкиСудов.Трюм
	|
	|УПОРЯДОЧИТЬ ПО
	|	Трюм";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
КонецПроцедуры

Процедура ТекстЗапросаТаблицаСостоянияФрахта(ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "гкс_СостоянияФрахта";
	
	Если Не гкс_ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли; 
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ДанныеДокумента.Период КАК Период,
	|	ДанныеДокумента.Фрахт КАК Фрахт,
	|	ЗНАЧЕНИЕ(Перечисление.гкс_СостоянияТранспортныхСредств.ВыгрузкаРазрешена) КАК Состояние
	|ИЗ
	|	ДанныеДокумента КАК ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_Фрахт КАК ДокументФрахт
	|		ПО ДанныеДокумента.Фрахт = ДокументФрахт.Ссылка";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
КонецПроцедуры

Процедура ТекстЗапросаТаблицаВыработкаСмены(ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "гкс_ВыработкаСмены";
	
	Если Не гкс_ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли; 
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ДанныеДокумента.Фрахт КАК Фрахт,
	|	ДанныеДокумента.ПроизводственныеСутки КАК ПроизводственныеСутки,
	|	ДанныеОбработкиСудна.ДатаОкончания КАК ДатаОкончанияОперации,
	|	ДанныеОбработкиСудна.Трюм КАК Трюм,
	|	ДанныеОбработкиСудна.Силос КАК Силос,
	|	ДанныеОбработкиСудна.Количество КАК Количество
	|ПОМЕСТИТЬ ВыработкаСмены
	|ИЗ
	|	ДанныеДокумента КАК ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеОбработкиСудна КАК ДанныеОбработкиСудна
	|		ПО ДанныеДокумента.Ссылка = ДанныеОбработкиСудна.Ссылка
	|		И ДанныеОбработкиСудна.Количество > 0
	|		И НЕ ДанныеОбработкиСудна.ДатаОкончания = &ПустаяДата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыработкаСмены.Фрахт КАК Фрахт,
	|	ВыработкаСмены.ДатаОкончанияОперации КАК Период,
	|	ВыработкаСмены.ПроизводственныеСутки КАК ПроизводственныеСутки,
	|	ВыработкаСмены.Трюм КАК Трюм,
	|	ВыработкаСмены.Силос КАК Силос,
	|	ВыработкаСмены.Количество КАК Количество,
	|	ЕСТЬNULL(ПланыРазгрузкиСудов.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
	|	ЕСТЬNULL(ПланыРазгрузкиСудов.ЕдиницаИзмеренияВеса, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) КАК
	|		ЕдиницаИзмеренияВеса
	|ИЗ
	|	ВыработкаСмены КАК ВыработкаСмены
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланыРазгрузкиСудов КАК ПланыРазгрузкиСудов
	|		ПО ВыработкаСмены.Трюм = ПланыРазгрузкиСудов.Трюм
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период,
	|	Трюм";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
